docs/induccionestructural.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-26 Sat 22:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inducción estructural</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a href="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Inducción estructural</h1>
<p>
Normalmente aplicamos inducción sobre los números naturales, y cuando
necesitamos aplicar inducción en otro contexto lo hacemos corresponder con los 
números naturales. Por ejemplo, si queremos demostrar una propiedad sobre los
árboles binarios, la demostraríamos por inducción sobre la altura del
árbol. Pero el proceso de llevar todo a los naturales puede ser
incómodo, tedioso y puede complicar la demostración innecesariamente. En
este post vamos a desarrollar una forma de ampliar la inducción a la
estructura de los tipos de datos para simplificar todas esas
demostraciones.
</p>

<div id="outline-container-org8b51180" class="outline-2">
<h2 id="org8b51180">Conjuntos bien fundados</h2>
<div class="outline-text-2" id="text-org8b51180">
<p>
Vamos a definir las relaciones bien fundadas, que nos permitirán definir
una inducción generalizada. [1]
</p>

<ul class="org-ul">
<li><b>Relación bien fundada:</b> una relación en un conjunto de elementos
es bien fundada si todo subconjunto no vacío tiene un elemento
minimal. Dado un orden parcial, es bien fundado si todo subconjunto
no vacío tiene un elemento tal que ninguno es menor que él.</li>
</ul>

<p>
Y podemos realizar inducción sobre cualquier conjunto con una relación
bien fundada.
</p>

<ul class="org-ul">
<li><p>
<b>Inducción noetheriana:</b> sea \(X\) un conjunto bien fundado con
\(A \subset X\). Si se cumple:
</p>

<p>
\[ (y < x \Rightarrow y \in A) \Rightarrow x \in A \]
</p>

<p>
Entonces \(A = X\).
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org7fef1fa" class="outline-2">
<h2 id="org7fef1fa">Inducción sobre tipos</h2>
<div class="outline-text-2" id="text-org7fef1fa">
<p>
Ahora vamos a aplicar esto a teoría de tipos. Sea un tipo con sus
constructores. Para todas las instancias constructibles del tipo (es decir,
aquellas que pueden
generarse en un número finito de pasos desde sus constructores),
definimos un orden parcial:
</p>

<ul class="org-ul">
<li><b>Orden constructivo:</b> para dos instancias del tipo: \(a,b::A\),
\(b\) se construye con \(a\) si el constructor de \(b\) toma a \(a\)
como argumento. La clausura transitiva de esta relación forma un
orden parcial:
\[ a \leq b \Rightarrow a \mbox{ se usa en la construcción de } b \]</li>
</ul>

<p>
Y ahora tenemos una inducción sobre los constructores de los tipos, que
describimos ahora.
</p>

<ul class="org-ul">
<li><b>Inducción sobre tipos</b>: sea un tipo \(A\) con constructores y sea
\(P :: A \rightarrow Bool\) una propiedad. Siendo
\(a_1, a_2 \dots a_i :: A\) argumentos del constructor, si se cumple
la condición de inducción para cada constructor \(C_i\):
\[P(a_1) \wedge P(a_2) \wedge \dots P(a_i) \Rightarrow P(C_i(a_1,a_2,\dots,b_0,b_1\dots))\]</li>
</ul>

<p>
Entonces \(a::A \Rightarrow P(a)\)
</p>
</div>
</div>

<div id="outline-container-orga6c7daa" class="outline-2">
<h2 id="orga6c7daa">Ejemplo 1: Naturales</h2>
<div class="outline-text-2" id="text-orga6c7daa">
<p>
Nuestro primer ejemplo va a ser obtener la inducción sobre los naturales
como caso particular. Damos una definición de los naturales en lenguaje
Haskell, con los axiomas de Peano, un natural es 0 o el siguiente de un
natural:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">data</span> <span style="color: #92a65e; font-weight: bold;">Nat</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">O</span>
         <span style="color: #cae682;">|</span> <span style="color: #92a65e; font-weight: bold;">S</span> <span style="color: #92a65e; font-weight: bold;">Nat</span>
</pre>
</div>

<p>
Que equivale a la definición en Coq:
</p>

<pre class="example">
Inductive nat : Type :=
  | O : nat
  | S : nat -&gt; nat
</pre>

<p>
Es decir, si lo demostramos para <code>0</code> y para <code>S n</code> sabiéndolo para <code>n</code>,
lo hemos demostrado para todos los naturales.
</p>
</div>
</div>

<div id="outline-container-orgab0ddbd" class="outline-2">
<h2 id="orgab0ddbd">Ejemplo 2: Árboles binarios</h2>
<div class="outline-text-2" id="text-orgab0ddbd">
<p>
Ahora vamos a intentar el ejemplo que motivó esta búsqueda. Definimos un
árbol binario como un árbol vacío o como un nodo del que surgen dos
árboles binarios, en Haskell:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">data</span> <span style="color: #92a65e; font-weight: bold;">Tree</span> a <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Empty</span>
            <span style="color: #cae682;">|</span> <span style="color: #92a65e; font-weight: bold;">Node</span> a <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Tree</span> a<span style="color: #DCDCCC;">)</span> <span style="color: #DCDCCC;">(</span><span style="color: #92a65e; font-weight: bold;">Tree</span> a<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
Que equivale a la definición en Coq:
</p>

<pre class="example">
Inductive tree (X:Type) : Type :=
  | nilt : tree X
  | node : X -&gt; tree X -&gt; tree X -&gt; tree X.
</pre>

<p>
Es decir, si demostramos una propiedad para el árbol vacío y para un
árbol sabiendo que la cumplen sus subárboles derecho e izquierdo, la
hemos demostrado para todos los árboles binarios.
</p>

<p>
En el repositorio <a href="https://github.com/MROMAN42/recorridosArboles">mroman42/recorridosArboles</a> hay
varias demostraciones por inducción sobre árboles binarios, explicados
en lenguaje natural y demostrados luego sobre el asistente de
demostraciones Coq.
</p>

<p>
[1] Post sobre generalizaciones de la inducción <a href="http://math.blogoverflow.com/2015/03/10/when-can-we-do-induction/">en Stack Overflow</a>.   </p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2015-03-14 Sat 15:02. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
